rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/AI_API_OpenAI.cpp
// ESP32_AI_Connect/AI_API_OpenAI.cpp

#include "ESP32_AI_Connect_config.h" // Include config first

#ifdef USE_AI_API_OPENAI // Only compile this file's content if flag is set

#include "AI_API_OpenAI.h"

String AI_API_OpenAI_Handler::getEndpoint(const String& modelName, const String& apiKey, const String& customEndpoint) const {
    if (customEndpoint.length() > 0) {
        return customEndpoint;
    }
    return "https://api.openai.com/v1/chat/completions";
}

void AI_API_OpenAI_Handler::setHeaders(HTTPClient& httpClient, const String& apiKey) {
    httpClient.addHeader("Content-Type", "application/json");
    httpClient.addHeader("Authorization", "Bearer " + apiKey);
}

String AI_API_OpenAI_Handler::buildRequestBody(const String& modelName, const String& systemRole,
                                              float temperature, int maxTokens,
                                              const String& userMessage, JsonDocument& doc,
                                              const String& customParams) {
    doc.clear();

    doc["model"] = modelName;
    
    JsonArray messages = doc.createNestedArray("messages");
    if (systemRole.length() > 0) {
        JsonObject systemMsg = messages.createNestedObject();
        systemMsg["role"] = "system";
        systemMsg["content"] = systemRole;
    }
    JsonObject userMsg = messages.createNestedObject();
    userMsg["role"] = "user";
    userMsg["content"] = userMessage;

    // Process custom parameters if provided
    if (customParams.length() > 0) {
        // Create a temporary document to parse the custom parameters
        DynamicJsonDocument paramsDoc(512);
        DeserializationError error = deserializeJson(paramsDoc, customParams);
        
        // Only proceed if parsing was successful
        if (!error) {
            // Add each parameter from customParams to the request
            for (JsonPair param : paramsDoc.as<JsonObject>()) {
                // Skip model and messages as they are handled separately
                if (param.key() != "model" && param.key() != "messages") {
                    // Copy the parameter to our request document
                    doc[param.key()] = param.value();
                }
            }
        }
    }
    
    // Add standard parameters if set (these override any matching custom parameters)
    if (temperature >= 0.0) doc["temperature"] = temperature;
    if (maxTokens > 0) doc["max_completion_tokens"] = maxTokens;
    // Add other OpenAI specific params like response_format if needed

    String requestBody;
    serializeJson(doc, requestBody);
    return requestBody;
}

String AI_API_OpenAI_Handler::parseResponseBody(const String& responsePayload,
                                                String& errorMsg, JsonDocument& doc) {
    // Move the logic from the original _parseOpenAIResponse here
    // IMPORTANT: Use the provided 'doc' and 'errorMsg' references. Clear doc first.
    resetState(); // Reset finish reason and tokens before parsing
    doc.clear();
    errorMsg = ""; // Clear previous error

    DeserializationError error = deserializeJson(doc, responsePayload);
    if (error) {
        errorMsg = "JSON Deserialization failed: " + String(error.c_str());
        return "";
    }

    if (doc.containsKey("error")) {
        errorMsg = String("API Error: ") + (doc["error"]["message"] | "Unknown error");
        return "";
    }

    // Extract total tokens if available
    if (doc.containsKey("usage") && doc["usage"].is<JsonObject>()) {
        JsonObject usage = doc["usage"];
        if (usage.containsKey("total_tokens")) {
            _lastTotalTokens = usage["total_tokens"].as<int>(); // Store in base class member
        }
    }

    if (doc.containsKey("choices") && doc["choices"].is<JsonArray>() && !doc["choices"].isNull() && doc["choices"].size() > 0) {
       JsonObject firstChoice = doc["choices"][0];

       // Extract finish reason if available
       if (firstChoice.containsKey("finish_reason")) {
           _lastFinishReason = firstChoice["finish_reason"].as<String>(); // Store in base class member
       }

       if (firstChoice.containsKey("message") && firstChoice["message"].is<JsonObject>()) {
           JsonObject message = firstChoice["message"];
           if (message.containsKey("content") && message["content"].is<const char*>()) {
               return message["content"].as<String>();
           }
       }
    }

    errorMsg = "Could not find 'choices[0].message.content' in response.";
    return ""; // Return empty string if content not found
}

#ifdef ENABLE_STREAM_CHAT
String AI_API_OpenAI_Handler::buildStreamRequestBody(const String& modelName, const String& systemRole,
                                                    float temperature, int maxTokens,
                                                    const String& userMessage, JsonDocument& doc,
                                                    const String& customParams) {
    // Use the same logic as buildRequestBody but add "stream": true
    doc.clear();

    doc["model"] = modelName;
    doc["stream"] = true; // Enable streaming
    
    JsonArray messages = doc.createNestedArray("messages");
    if (systemRole.length() > 0) {
        JsonObject systemMsg = messages.createNestedObject();
        systemMsg["role"] = "system";
        systemMsg["content"] = systemRole;
    }
    JsonObject userMsg = messages.createNestedObject();
    userMsg["role"] = "user";
    userMsg["content"] = userMessage;

    // Process custom parameters if provided
    if (customParams.length() > 0) {
        // Create a temporary document to parse the custom parameters
        DynamicJsonDocument paramsDoc(512);
        DeserializationError error = deserializeJson(paramsDoc, customParams);
        
        // Only proceed if parsing was successful
        if (!error) {
            // Add each parameter from customParams to the request
            for (JsonPair param : paramsDoc.as<JsonObject>()) {
                // Skip model, messages, stream as they are handled separately
                if (param.key() != "model" && param.key() != "messages" && param.key() != "stream") {
                    // Copy the parameter to our request document
                    doc[param.key()] = param.value();
                }
            }
        }
    }
    
