rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/AI_API_OpenAI.cpp
    // Set the model
    doc["model"] = modelName;
    
    // Add max_completion_tokens parameter if specified
    if (followUpMaxTokens > 0) {
        doc["max_completion_tokens"] = followUpMaxTokens;
    }
    
    // Add messages array
    JsonArray messages = doc.createNestedArray("messages");
    
    // Add system message if specified
    if (systemMessage.length() > 0) {
        JsonObject systemMsg = messages.createNestedObject();
        systemMsg["role"] = "system";
        systemMsg["content"] = systemMessage;
    }
    
    // Add the original user message
    JsonObject userMsg = messages.createNestedObject();
    userMsg["role"] = "user";
    userMsg["content"] = lastUserMessage;
    
    // Add the assistant's tool call response
    JsonObject assistantMsg = messages.createNestedObject();
    assistantMsg["role"] = "assistant";
    
    // Parse and add the tool calls
    DynamicJsonDocument toolCallsDoc(1024);
    DeserializationError error = deserializeJson(toolCallsDoc, lastAssistantToolCallsJson);
    if (!error && toolCallsDoc.is<JsonArray>()) {
        JsonArray toolCalls = assistantMsg.createNestedArray("tool_calls");
        
        // Copy each tool call
        for (JsonVariant toolCall : toolCallsDoc.as<JsonArray>()) {
            JsonObject newToolCall = toolCalls.createNestedObject();
            
            // Copy all properties of the tool call
            for (JsonPair kv : toolCall.as<JsonObject>()) {
                if (kv.value().is<JsonObject>()) {
                    JsonObject subObj = newToolCall.createNestedObject(kv.key().c_str());
                    JsonObject srcSubObj = kv.value().as<JsonObject>();
                    
                    for (JsonPair subKv : srcSubObj) {
                        subObj[subKv.key().c_str()] = subKv.value();
                    }
                } else {
                    newToolCall[kv.key().c_str()] = kv.value();
                }
            }
        }
    }
    
    // Parse and add tool results as tool messages
    DynamicJsonDocument toolResultsDoc(1024);
    error = deserializeJson(toolResultsDoc, toolResultsJson);
    if (!error && toolResultsDoc.is<JsonArray>()) {
        for (JsonVariant result : toolResultsDoc.as<JsonArray>()) {
            JsonObject toolMsg = messages.createNestedObject();
            toolMsg["role"] = "tool";
            
            // Copy tool_call_id from the result
            if (result.containsKey("tool_call_id")) {
                toolMsg["tool_call_id"] = result["tool_call_id"];
            }
            
            // Extract content from function.output
            if (result.containsKey("function") && result["function"].is<JsonObject>()) {
                JsonObject function = result["function"];
                if (function.containsKey("output")) {
                    toolMsg["content"] = function["output"];
                }
            }
        }
    }
    
    // Add follow-up tool_choice if specified
    if (followUpToolChoice.length() > 0) {
        String trimmedChoice = followUpToolChoice;
        trimmedChoice.trim();
        
        // Check if it's one of the allowed string values
        if (trimmedChoice == "auto" || trimmedChoice == "none" || trimmedChoice == "required") {
            // Simple string values can be added directly
            doc["tool_choice"] = trimmedChoice;
        } 
        // Check if it starts with { - might be a JSON object string
        else if (trimmedChoice.startsWith("{")) {
            // Try to parse it as a JSON object
            DynamicJsonDocument toolChoiceDoc(512);
            DeserializationError error = deserializeJson(toolChoiceDoc, trimmedChoice);
            
            if (!error) {
                // Successfully parsed as JSON - add as an object
                JsonObject toolChoiceObj = doc.createNestedObject("tool_choice");
                
                // Copy all fields from the parsed JSON
                for (JsonPair kv : toolChoiceDoc.as<JsonObject>()) {
                    if (kv.value().is<JsonObject>()) {
                        JsonObject subObj = toolChoiceObj.createNestedObject(kv.key().c_str());
                        JsonObject srcSubObj = kv.value().as<JsonObject>();
                        
                        for (JsonPair subKv : srcSubObj) {
                            subObj[subKv.key().c_str()] = subKv.value();
                        }
                    } else {
                        toolChoiceObj[kv.key().c_str()] = kv.value();
                    }
                }
            } else {
                // Not valid JSON - add as string but this will likely cause an API error
                #ifdef ENABLE_DEBUG_OUTPUT
                Serial.println("Warning: follow-up tool_choice value is not valid JSON: " + trimmedChoice);
                #endif
                doc["tool_choice"] = trimmedChoice;
            }
        } else {
            // Not a recognized string value or JSON - add as string but will likely cause an API error
            #ifdef ENABLE_DEBUG_OUTPUT
            Serial.println("Warning: follow-up tool_choice value is not recognized: " + trimmedChoice);
            #endif
            doc["tool_choice"] = trimmedChoice;
        }
    }
    
    // Add tools array
    JsonArray tools = doc.createNestedArray("tools");
    
    // Parse and add each tool from the toolsArray (same logic as buildToolCallsRequestBody)
    for (int i = 0; i < toolsArraySize; i++) {
        // Create a temporary JsonDocument to parse the tool JSON string
        StaticJsonDocument<512> tempDoc; // Adjust size as needed
        DeserializationError error = deserializeJson(tempDoc, toolsArray[i]);
        
        if (error) {
            // Skip invalid JSON
            continue;
        }
        
        // Check if the tool is already in OpenAI format (has 'type' and 'function' fields)
        if (tempDoc.containsKey("type") && tempDoc.containsKey("function")) {
            // Already in OpenAI format - copy directly to tools array
            JsonObject tool = tools.createNestedObject();
            
            // Copy type
            tool["type"] = tempDoc["type"];
            
            // Copy function
            JsonObject function = tool.createNestedObject("function");
            JsonObject srcFunction = tempDoc["function"];
            
