rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/AI_API_OpenAI.cpp
            // Copy function properties
            if (srcFunction.containsKey("name")) {
                function["name"] = srcFunction["name"].as<String>();
            }
            
            if (srcFunction.containsKey("description")) {
                function["description"] = srcFunction["description"].as<String>();
            }
            
            if (srcFunction.containsKey("parameters")) {
                JsonObject params = function.createNestedObject("parameters");
                JsonObject srcParams = srcFunction["parameters"];
                
                for (JsonPair kv : srcParams) {
                    if (kv.value().is<JsonObject>()) {
                        JsonObject subObj = params.createNestedObject(kv.key().c_str());
                        JsonObject srcSubObj = kv.value().as<JsonObject>();
                        
                        for (JsonPair subKv : srcSubObj) {
                            subObj[subKv.key().c_str()] = subKv.value();
                        }
                    } else if (kv.value().is<JsonArray>()) {
                        JsonArray arr = params.createNestedArray(kv.key().c_str());
                        JsonArray srcArr = kv.value().as<JsonArray>();
                        
                        for (const auto& item : srcArr) {
                            arr.add(item);
                        }
                    } else {
                        params[kv.key().c_str()] = kv.value();
                    }
                }
            }
        } else {
            // Simple format - wrap in OpenAI format
            // Add this tool to the tools array with type: "function"
            JsonObject tool = tools.createNestedObject();
            tool["type"] = "function";
            
            JsonObject function = tool.createNestedObject("function");
            
            // Copy all properties from the simple format to the function object
            for (JsonPair kv : tempDoc.as<JsonObject>()) {
                if (kv.value().is<JsonObject>()) {
                    JsonObject subObj = function.createNestedObject(kv.key().c_str());
                    JsonObject srcSubObj = kv.value().as<JsonObject>();
                    
                    for (JsonPair subKv : srcSubObj) {
                        subObj[subKv.key().c_str()] = subKv.value();
                    }
                } else if (kv.value().is<JsonArray>()) {
                    JsonArray arr = function.createNestedArray(kv.key().c_str());
                    JsonArray srcArr = kv.value().as<JsonArray>();
                    
                    for (const auto& item : srcArr) {
                        arr.add(item);
                    }
                } else {
                    function[kv.key().c_str()] = kv.value();
                }
            }
        }
    }
    
    String requestBody;
    serializeJson(doc, requestBody);
    return requestBody;
}
#endif

#endif // USE_AI_API_OPENAI